{"pages":[],"posts":[{"title":"Cara Menggunakan Fitur Forgot Password Zimbra","text":"Tahukah kamu bahwa pada Zimbra mulai versi 8.8.9 sudah terdapat fitur baru yang sangat membantu user dan administrator? Yap benar, fitur tersebut adalah fitur Forgot Password pada Zimbra yang ada mulai di versi tersebut. Fitur ini sangat berguna jika ada salah satu user yang lupa dengan password dari akun Zimbra tersebut. User tidak perlu repot-repot meminta reset password kepada administrator agar dapat menggunakan emailnya kembali.Dari sisi administrator juga dimudahkan, karena menghilangkan salah satu beban pekerjaannya. Untuk menggunakan Fitur Forgot password di Zimbra ini, pastikan kamu sudah menambahkan Password Recovery Account di menu preference webmail Zimbra kamu. Jika bingung kamu dapat cek postingan saya sebelumnya yakni Cara Menambahkan Password Recovery Account di Zimbra.Kamu sudah melakukan penambahan password recovery account? Oke, jika sudah maka kamu sudah dapat menggunakan Fitur Forgot password tersebut. Bagaimana cara menggunakan fitur forgot password di Zimbra? Berikut Tutorial Cara Menggunakan Fitur Forgot Password Zimbra.Cara Menggunakan Fitur Forgot Password Zimbra.Jika kamu sudah menambahkan password recovery account pada Email Zimbra kamu, kamu tak perlu khawatir lagi jika kamu lupa password. Pada menu login awal, kamu bisa klik menu Forgot Password dibawah tombol Sign in.Kemudian kamu akan dialihkan ke menu Forgot Password. Silakan isi username dari email zimbra yang kamu miliki, jika sudah pilih Submit.Maka akan muncul email password recovery kamu. Untuk melakukan reset password, pilih Request Code. Kemudian cek pada akun recovery password kamu dan dapatkan code yang dikirimkan dari email server Zimbra.Salin kode yang diberikan dari Zimbra tersebut. Kode tersebut hanya valid dalam waktu 10 menit kedepan, jadi kamu tidak boleh berlama-lama menginputnya.Kembali ke email server Zimbra, kemudian masukkan kode yang diberikan tadi. Jika sudah klik Verify Code.Kemudian kita akan dihadapkan pada 2 pilihan, karena tujuan utamanya adalah untuk mereset password maka pilih Reset Password.Kemudian isikan password baru email zimbra yang kamu miliki. Pastikan password tersebut memiliki kriteria Strong Password agar tidak mudah diketahui atau diretas oleh pihak lain. Jika sudah pilih SubmitSekarang password akun email Zimbra kamu sudah berhasil di reset dan dapat digunakan kembali. Mudah bukan? Fitur ini memang sangat memudahkan kita sebagai user untuk melakukan reset password email akun tersebut.Silakan share ke teman kamu yang menggunakan Zimbra juga agar tidak ketinggalan info ini.Link Forgot Password tidak muncul pada halaman login? Tenang saja! Buka link dibawah iniMengatasi link forgot password tidak muncul pada login screenSource","link":"/cara-menggunakan-fitur-forgot-password/"},{"title":"Cara install fail2ban zimbra","text":"Server Mail seperti Zimbra memiliki addon anti-spam tersendiri untuk memblok aktifitas jahat.Fail2ban menyediakan perlindungan tambahan ke server mail.Server Mail yang bagus selalu melawan spam!Fail2ban dapat dengan mudah ban IP yang mencoba login terlalu banyak.Hari ini, ayo diskusi bagaimana Support Engineers kita set up fail2ban untuk Zimbra mail untuk konsumen kita.Zimbra Mail server dengan Fail2banZimbra menyediakan server open source dan client software untuk messaging dan collaboration.Untuk melindungi mail dari serangan terus menerus kita menggunakan fail2ban. Sebagai tambahan, Fail2ban melindungi server dari serangan paksaan.Fail2ban scans file log dan ban IPs yang menunjukkan tanda jahat.Ayo diskusi bagaimana Support Engineers kita set up fail2ban untuk Zimbra mailCara setup fail2ban untuk server Zimbra mailBaru saja satu dari konsumen menghubungi kita untuk set up fail2ban untuk server Zimbra Mail. Ayo kita diskusikan cara set up fail2ban untuk konsumen kita.Pertama, kita meyakinkan bahwa fail2ban dan iptables terinstall di server. jika belum kita install fail2ban dan iptables dahulu.12yum install epel-releaseyum install fail2banSetelah terinstall, copy file default jail.conf untuk membuat konfigurasi lokal dengan perintah sebagai berikut1sudo cp /etc/fail2ban/jail.conf /etc/fail2ban/jail.localKita butuh membuat filter di fail2ban.filter digunakan untuk identifikasi gagal autentifikasi untuk service spesifik.Secara default, ada filter untuk service yang secara umum digunakan terbanyak. jadi secara manual tambahkan filter di /etc/fail2ban/filter.d buat sebuah file dan tambahkan perintah sebagai berikut.1vi /etc/fail2ban/filter.d/zimbra.conf1234567[Definition]failregex = \\[ip=&lt;HOST&gt;;\\] account - authentication failed for .* \\(no such account\\)$\\[ip=&lt;HOST&gt;;\\] security - cmd=Auth; .* error=authentication failed for .*, invalid password;$;oip=&lt;HOST&gt;;.* security - cmd=Auth; .* protocol=soap; error=authentication failed for .* invalid password;$\\[oip=&lt;HOST&gt;;.* SoapEngine - handler exception: authentication failed for .*, account not found$WARN .*;ip=&lt;HOST&gt;;ua=ZimbraWebClient .* security - cmd=AdminAuth; .* error=authentication failed for .*;$NOQUEUE: reject: RCPT from .*\\[&lt;HOST&gt;\\]: 550 5.1.1 .*: Recipient address rejected:Save file nya.Sekarang kita tambahkan konten jail untuk Zimbra. Tambahkan detail di jail.conf atau di jail.local berdasarkan konfigurasi. Edit file nya seperti berikut1vi /etc/fail2ban/jail.local1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950# This jail forces the backend to &quot;polling&quot;.[ssh-iptables]enabled = falsefilter = sshdaction = iptables[name=SSH, port=ssh, protocol=tcp]sendmail-whois[name=SSH, dest=mail@domian.com, sender=mail@example.com]logpath = /var/log/messagesmaxretry = 5# jail for Zimbra[zimbra-account]enabled = truefilter = zimbraaction = iptables-allports[name=zimbra-account]sendmail[name=zimbra-account, dest=mail@example.com]logpath = /opt/zimbra/log/mailbox.logbantime = 600maxretry = 5[zimbra-audit]enabled = truefilter = zimbraaction = iptables-allports[name=zimbra-audit]sendmail[name=Zimbra-audit, dest=mail@example.com]logpath = /opt/zimbra/log/audit.logbantime = 600maxretry = 5[zimbra-recipient]enabled = truefilter = zimbraaction = iptables-allports[name=zimbra-recipient]sendmail[name=Zimbra-recipient, dest=mail@example.com]logpath = /var/log/zimbra.logbantime = 172800maxretry = 5# jail for postfix since postfix performs Zimbra mail transfer[postfix]enabled = truefilter = postfixaction = iptables-multiport[name=postfix, port=smtp, protocol=tcp]sendmail-buffered[name=Postfix, dest=mail@example.com]logpath = /var/log/zimbra.logbantime = 172800maxretry = 5Berikut, ubah konfigurasi Sendmail. edit file /etc/fail2ban/action.d/sendmail.conf dan ubah1Fail2Ban&quot; | /usr/sbin/sendmail -f &lt;sender&gt; &lt;dest&gt;menjadi1Fail2Ban&quot; | /opt/zimbra/postfix/sbin/sendmail -f &lt;sender&gt; &lt;dest&gt;Akhirnya, restart service Fail2ban.1service fail2ban restartKita menggunakan perintah untuk menemukan detail mengenai ban1fail2ban-client status zimbra-auditHasil nya tampil seperti berikutSetelah selesai, sekarang lihat aturan iptable untuk bagian jail yang baru saja di tambahkan di masing-masing modul aplikasi yang di enabled.1sudo iptables -LBerbagai alamat IP yang di ban akan muncul di bagian gagal login. Kamu juga bisa secara manual ban alamat IP dari service dengan perintah sebagai berikut.123sudo fail2ban-client set &lt;jail&gt; banip/unbanip &lt;ip address&gt;# Contohnyasudo fail2ban-client set sshd unbanip 83.136.253.43","link":"/how-to-install-fail2ban-zimbra/"},{"title":"Cara Aktifasi Fitur Forgot Password Zimbra","text":"Zimbra baru saja menginformasikan versi terbaru yaitu Zimbra 8.8.9 dengan codename Curie. Salah satu fitur yang dimunculkan adalah Forgot Password / Self-serve Account Recovery. Dengan mengaktifkan fitur forgot password di Zimbra 8.8.9 ini, user dapat melakukan perubahan atau reset password tanpa harus menghubungi tim Admin Zimbra.Secara default, fitur ini dalam status belum aktif sehingga diaktifkan secara manual baik di level COS maupun User.Untuk mengaktifkan di level COS gunakan perintah berikut sebagai user zimbra:123zmprov mc nama_cos zimbraFeatureResetPasswordStatus enabled1zmprov mc nama_cos zimbraFeatureResetPasswordStatus enabledUntuk mengaktifkan di level User gunakan perintah berikut sebagai user zimbra:123zmprov ma nama_account zimbraFeatureResetPasswordStatus enabled1zmprov ma nama_account zimbraFeatureResetPasswordStatus enabledContoh:Lakukan pengecekan terlebih dahulu untuk memastikan fitur tersebut sudah aktif atau belum1234567891011121314151617181920[root@zimbra ]# su - zimbra[zimbra@zimbra ~]$ zmprov gc staff_test zimbraFeatureResetPasswordStatus# name staff_testzimbraFeatureResetPasswordStatus: disabled12345[root@zimbra ]# su - zimbra [zimbra@zimbra ~]$ zmprov gc staff_test zimbraFeatureResetPasswordStatus# name staff_testzimbraFeatureResetPasswordStatus: disabledDisini kami menggunakan COS dengan nama staff_test[zimbra@zimbra ~]$ zmprov mc staff_test zimbraFeatureResetPasswordStatus enabled1[zimbra@zimbra ~]$ zmprov mc staff_test zimbraFeatureResetPasswordStatus enabledUntuk memastikan apakah fitur tersebut juga aktif di sisi user yang termasuk dalam COS staff_test, contoh disini adalah someone@example.com, Ketikkan perintah berikut:123456789[zimbra@zimbra ~]$ zmprov ga someone@example.com zimbraFeatureResetPasswordStatus# name someone@example.comzimbraFeatureResetPasswordStatus: enabled123[zimbra@zimbra ~]$ zmprov ga someone@example.com zimbraFeatureResetPasswordStatus# name someone@example.comzimbraFeatureResetPasswordStatus: enabledKetika perintah di atas di eksekusi, beberapa atribut yang diaktifkan di fitur ini antara lain:zimbraResetPasswordRecoveryCode – Recovery code sent to recovery email addresszimbraResetPasswordRecoveryCodeExpiry – Expiry time for password reset recovery code (Default: 10 minutes)zimbraRecoveryAccountVerificationData – A JSON encrypted token to contain all the data need to validate a verification code for email address.zimbraRecoveryAccountCodeValidity – Expiry time for recovery email code verification (Default: 1 day)zimbraPasswordRecoveryMaxAttempts – Maximum attempts for password recovery resend (Default: 10)zimbraFeatureResetPasswordSuspensionTime – time for which reset password feature is suspended (Default: 1 day)Setelah itu lakukan pengecekan di Zimbra Web Client di menu Preferences &gt; Accounts &gt; Password Recovery Account SettingsZimbra Forgot Password Menu - Mengaktifkan Fitur Forgot Password di Zimbra 8.8.9Selanjutnya kita tinggal memasukkan email lain untuk recovery password account someone@example.com. Dimana proses nya akan dilakukan verifikasi terlebih dahulu. Untuk lebih detilnya akan kita bahas di artikel berikutnya.Untuk pengelolaan self service password yang lebih advanced, anda bisa menggunakan JSSP dari Jabetto.Source","link":"/how-to-activate-forgot-password/"},{"title":"Membuat SPF, DMARC and DKIM","text":"Membuat SPF, DKIM and DMARCKetika menginstall Zimbra Collaboration, kita memerlukan konfigurasi system Security agar dapat mengirim Email, seperti ke Gmail, Hotmail, Yahoo!, dll. Dalam Tutorial ini akan di jelaskan bagaimana memberikan proteksi EmailSPFSender Policy Framework (SPF) merupakan suatu mekanisme suatu email yang berasal dari domain tertentu hanya bisa dikirim lewat suatu mail server yang ditunjuk. Dengan adanya record ini, maka pengiriman email yang berasal dari domain tertentu hanya diperbolehkan dari mail server yang telah ditentukan. Jika ada email yang berasal dari domain tersebut, tetapi tidak berasal dari mail server yang telah ditentukan, maka email tersebut akan ditolak. Dengan mekanisme ini maka akan mengurangi spam.Where needs to be configured?SPF diatur dari Public DNSParameter yang digunakan+all pass semua email, seperti tidak ada yang di konfigurasi.-all fail Hanya akan menandai email seperti pass jika sumber Server Email cocok, IP, MX, dll dengan entri SPF.~all softfail Mengizinkan mengirim email, dan jika ada sesuatu yang salah akan menandainya seperti softfail.?all neutral tanpa perbedaan kebijakan antara ~all dan -allJika domain Anda terkena serangan SPAM mencoba menipu domain Anda, coba ganti SPF menjadi -all for a while, and reset to ~all when the attack ends. Tetap pilih -all jika anda ingin benar-benar ketat dengan entri SPF dan Anda yakin bahwa entri DNS Anda sudah benar.Silahkan di coba hasil konfigurasinyaPilih salah satu web di bawahhttp://tools.wordtothewise.com/spf (akan menampilkan semua IP yang diizinkan yang dapat dikirim menggunakan domain)http://www.kitterman.com/spf/validate.html (Sederhana namun efektif, akan menunjukkan entri DNS SPF dan juga hasilnya: pass, softfail, fail, neutral, dll.)http://mxtoolbox.com/ A ClassicDKIMDKIM merupakan kependekan dari DomainKeys Identified Mail, suatu metode untuk melakukan verifikasi email apakah benar-benar dari pengirim atau mengaku sebagai pengirim.Pengirim disini dapat diverifikasi pada level domain. Pada domain ada record tertentu yang berisi suatu public key dan pada server tersebut pasti ada private keynya. Pada setiap pesan yang dikirimkan dari domain tersebut akan ditambahkan suatu text yang dienkrip dari private key tersebut. Text ini ditambahkan pada header email tersebut.Penerima kemudian melakukan decryption dengan menggunakan public_key yang bisa didapatkan pada record DNS tersebut, jika berhasil maka dipastikan bahwa email tersebut benar-benar dari domain tersebut.Darimana DKIM di dapat?DKIM perlu di generated tiap domain di Zimbra Server, dan di atur di public DNS tiap domain.Menambah DKIM data yang belum ada konfigurasi DKIM-a -d example.com```1Setelah data di generated,di public DNS record data harus di isi ke DNS server seperti yang di tampilkan:zimbra@example.com:~$ /opt/zimbra/libexec/zmdkimkeyutil -a -d example.comDKIM Data added to LDAP for domain example.com with selector 0E9F184A-9577-11E1-AD0E-2A2FBBAC6BCBPublic key to enter into DNS:0E9F184A-9577-11E1-AD0E-2A2FBBAC6BCB._domainkey IN TXT “v=DKIM1;=rsa;p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDY5CBg15nZ2vYnRmrNub6Jn6ghQ2DXQbQgOJ/E5IGziUYEuE2OnxkBm1h3jived21uHjpNy0naOZjLj0xLyyjclVy1chrhSbsGAhe8HLXUsdXyfRvNTq8NWLsUnMEsoomtJCJ/6LYWYU1whOQ9oKZVAwWHSovAWZpByqNMZmFg7QIDAQAB” ; —– DKIM 0E9F184A-9577-11E1-AD0E-2A2FBBAC6BCB for example.com12**Update DKIM data jika sudah ada **```/opt/zimbra/libexec/zmdkimkeyutil -u -d example.comKetika DKIM diperbarui, server DNS harus dimuat ulang dengan catatan TXT baru. Disarankan untuk membuang TXT sebelumnya di DNS.Menghapus DKIM data dari domain-r -d example.com```1234Command ini untuk menghapus **DKIM** data dari **LDAP**. Email baru tidak akan di tandai dalam **DKIM**. The DNS TXT record should remain for a period of time to allow verification of emails signed with this key.**Melihat DKIM data**```/opt/zimbra/libexec/zmdkimkeyutil -q -d example.comThis command will output all the stored DKIM information, specifically12345DKIM DomainDKIM SelectorDKIM Private KeyDKIM Public SignatureDKIM IdentityMengecek validasi DKIMhttp://dkimcore.org/tools/keycheck.htmlAfter a few seconds you will see the result:DMARCDMARC, kependekan dari “Domain-based Message Authentication, Reporting &amp; Conformance”, adalah sistem yang menyediakan arahan atau informasi apabila email tidak terautentikasi.Konfigurasi DMARCDMARC record bisa di generated dari website, sebagai contoh http://www.kitterman.com/dmarc/assistant.htmlKonfigurasi tersebut akan meng-generate untuk isi DNSDMARC record untuk: example.com12Record diisi dengan _dmarc.example.comv=DMARC1; p=quarantine; rua=dmarc@example.com; ruf=dmarc@example.com; sp=quarantineDan di Public DNS isi seperti ini:Test DMARCSalah satu situs untuk cek DMARC adalah - https://dmarcian.com/dmarc-inspector/google.com dengan domain google.com. Website ini akan menunjukkan informasi DMARC domain Anda.","link":"/howTo-create-SPF-DMARC-and-DKIM/"},{"title":"Mengatasi Link Forgot Password Zimbra Yang Tidak Muncul","text":"Beberapa hari yang lalu Zimbra telah mengeluarkan Zimbra versi terbaru 8.8.9, dan untuk saat ini pun versi tersebut sudah ada Patch 4 nya. Kemudian salah 1 fitur terbaru yang ada pada zimbra 8.8.9 yaitu adanya fitur Forgot Password. Fitur ini ada pada saat Patch 1 diluncurkan oleh zimbra dan saat itu statusnya pun masih Beta.Pada saat masih Patch 1, saya coba mengaktifkan fitur Forgot Password tersebut dan berhasil, ditandakan dengan adanya Link Forgot Password yang muncul pada tampilan Login Screen Zimbra. Untuk panduan enable Forgot Password tersebut, bisa lihat di artikel saya sebelumnya.Enable Fitur Forgot Password pada ZimbraKemudian ketika Patch 4 hadir, saya coba update dan ternyata setelah update tersebut, Link Forgot Password yang sebelumnya muncul di Login Screen, tiba-tiba tidak muncul. Saya pun coba ulangi command-command untuk enable fitur tersebut, namun hasilnya nihil. Tetap tidak munculAkhirnya saya mencari dan ketemu link ini https://rizkypratama.id/blog/2018/09/06/mengatasi-link-forgot-password-tidak-muncul-pada-login-screen-zimbra-8-8-9-patch-4/, katanya untuk hal itu bisa di edit dari sisi file login.jspNote : (Update) Artikel ini juga bisa digunakan untuk Zimbra Versi 8.8.9 keatasBerikut langkah-langkah nya123456789101112Edit file /opt/zimbra/jetty/webapps/zimbra/public/login.jspvi /opt/zimbra/jetty/webapps/zimbra/public/login.jspCari baris berikut ini&lt;c:if test=&quot;${domainInfo.attrs.zimbraFeatureResetPasswordStatus eq 'enabled'}&quot;&gt;Nanti akan terlihat script seperti berikut ini&lt;c:if test=&quot;${domainInfo.attrs.zimbraFeatureResetPasswordStatus eq 'enabled'}&quot;&gt;&lt;tr&gt; &lt;td&gt;&lt;/td&gt; &lt;td class=&quot;submitTD&quot;&gt; &lt;a href=&quot;#&quot; onclick=&quot;forgotPassword();&quot; id=&quot;ZLoginForgotPassword&quot; aria-controls=&quot;ZLoginForgotPassword&quot; aria-expanded=&quot;false&quot;&gt;&lt;fmt:message key=&quot;forgotPassword&quot;/&gt;&lt;/a&gt; &lt;/td&gt;&lt;/tr&gt;Kemudian silakan edit di bagian tersebut, hanya mengubah isi dibagian itu saja, code yang sebelumnya berada di atas sintaxt, dipindahkan menjadi dibawah. Berikut contoh perubahannya1234567&lt;tr&gt; &lt;td&gt;&lt;/td&gt; &lt;td class=&quot;submitTD&quot;&gt; &lt;a href=&quot;#&quot; onclick=&quot;forgotPassword();&quot; id=&quot;ZLoginForgotPassword&quot; aria-controls=&quot;ZLoginForgotPassword&quot; aria-expanded=&quot;false&quot;&gt;&lt;fmt:message key=&quot;forgotPassword&quot;/&gt;&lt;/a&gt; &lt;/td&gt;&lt;/tr&gt;&lt;c:if test=&quot;${domainInfo.attrs.zimbraFeatureResetPasswordStatus eq 'enabled'}&quot;&gt;Jika sudah, silakan disimpan kemudian restart service mailboxnya12su - zimbrazmmailboxdctl restartSilakan akses Zimbra nya dan lihat tampilan loginnya, maka tepat dibagian tombol Sign In, akan ada link Forgot PasswordMungkin cukup sekian, semoga bermanfaatSource","link":"/mengatasi-link-forgot-password-tidak-muncul-pada-login-screen-zimbra/"},{"title":"Check Zimbra Mail Server","text":"AntiVirus LogWatch/opt/zimbra/bin/amavis-logwatch /var/log/zimbra.logUpdate AntivirusCheck bahwa ini telah diset true, dan jika tidak, set menjadi true dan restart amavisd dan MTA:12345678$ zmlocalconfig antispam_enable_rule_updatesantispam_enable_rule_updates = false$ zmlocalconfig antispam_enable_restartsantispam_enable_restarts = false$ zmlocalconfig -e antispam_enable_rule_updates=true$ zmlocalconfig -e antispam_enable_restarts=true$ zmamavisdctl restart$ zmmtactl restartCheck versi Clamav1/opt/zimbra/common/sbin/clamd --version --config-file=/opt/zimbra/conf/clamd.conf","link":"/zimbra-command/"},{"title":"Install OpsManager MongoDb","text":"Ops Manager adalah tool luar biasa yang disediakan oleh MongoDB. Kamu butuh lisensi untuk menggunakannya di production dan keuntungannya setimpal(info lebih di mongodb.com).Kamu bisa melihat sebagai dashboard yang dibuka untuk siapa saja di organisasi anda, dimana kamu dapat sepenuhnya mengatur dan mengotomatiskan MongoDB instances, set replica dan sharding juga diberikan wawasan luas mengenai penggunaan dan data.Untuk melangkah lebih jauh, Arsitektur, Konfigurasi, Topologi Penyebaran ContohKonten:InstallasiSimple test deployment on CentOSAutomation AgentConfigurationAppendixSimple test deployment on CentOS (docs.opsmanager.mongodb.com)Ini adalah langkah pertama yang menarik dan bisa di gunakan untuk non-production environments (dev, staging). Anda dapat memvalidasi banyak aspek tentang prosedur, seperti port yang akan dibuka dan opsi OS.Semua Ops Manager komponen akan jalan di server yang sama: db, backup, application.MongoDB harus di install terlebih dahulu dan terkonfigurasi ke host Ops Manager data &amp; backup.Pre-requisites (hosts, ntpupdate, mongod, firewall):peringatan: Pastikan untuk dengan benar update DNS atau file /etc/hosts file dari setiap server, sebuah kesalahan kecil typo dapat membuat rumit (true story).123456789101112131415161718# pastikan ntp &amp; ntpupdate telah terinstal (ini penting untuk komunikasi antar server)sudo yum install ntpupdatesudo ntpdate 0.centos.pool.ntp.org# install MongoDB server &amp; shellecho &quot;[mongodb-org-4.2]name=MongoDB Repositorybaseurl=https://repo.mongodb.org/yum/redhat/$releasever/mongodb-org/4.2/x86_64/gpgcheck=1enabled=1gpgkey=https://www.mongodb.org/static/pgp/server-4.2.asc&quot; | sudo tee /etc/yum.repos.d/mongodb.reposudo yum install -y mongodb-org mongodb-org-shell# info: user mongod and group mongod have been created (you can add your user in mongod group)cat /etc/passwdcat /etc/group# service mongod jalan secara default, stop dan cegah dari started on server startupservice mongod statussudo service mongod stopsudo chkconfig --level 35 mongod off1234# buat direktori untuk mongod: application database, backup, logssudo mkdir -p /data/mongodb/opsmanager/appdbsudo chown -R mongod:mongod /data/mongodb/opsmanager/appdbsudo chmod 770 -R /data/mongodb/opsmanager/appdb123456# open Ops Manager portssudo firewall-cmd --permanent --zone=public --add-port=8080/tcpsudo firewall-cmd --permanent --zone=public --add-port=8443/tcpsudo firewall-cmd --permanent --zone=public --add-port=27000-28000/tcpsudo firewall-cmd --permanent --zone=public --add-port=25/tcpsudo firewall-cmd --reload123456KOnfigurasi &amp; jalankan MongoDB databases untuk Ops Manager (app &amp; backup)# path berdasarkan strategi direktori anda, ukuran cache dari kapasitas server Andasudo -u mongod mongod --port 27017 --dbpath /data/mongodb/opsmanager/appdb --logpath /data/mongodb/opsmanager/logs/appdb.log --wiredTigerCacheSizeGB 1 --forksudo -u mongod mongod --port 27018 --dbpath /data/mongodb/opsmanager/backup --logpath /data/mongodb/opsmanager/logs/backup.log --fork# anda dapat cek jika runningps -ef | grep mongod1234567891011121314151617181920212223242526272829Download dan install Ops Manager (sebelumnya diketahui sebagai MongoDB Monitoring Service, atau MMS)Go to mongodb download page.Select the version (latest stable one in my case) and copy RPM URL,For example: https://downloads.mongodb.com/on-prem-mms/rpm/mongodb-mms-4.2.5.56761.20191211T0141Z-1.x86_64.rpm.# ambil dan install versi yang dipilihcurl -OL https://downloads.mongodb.com/on-prem-mms/rpm/mongodb-mms-4.2.5.56761.20191211T0141Z-1.x86_64.rpmsudo rpm -ivh mongodb-mms-3.6.3.606-1.x86_64.rpm# ll /opt/mongodb/mms# mongodb-mms user and group have been createdcat /etc/passwdcat /etc/group# edit &amp; review properties file (contains the connection string to app db)sudo vi /opt/mongodb/mms/conf/conf-mms.properties# start Ops Manager!sudo service mongodb-mms start# Generating new Ops Manager private key...# Starting pre-flight checks# Successfully finished pre-flight checks# Migrate Ops Manager data# Running migrations...[ OK ]# Start Ops Manager server# Instance 0 starting...............[ OK ]# Starting pre-flight checks# Successfully finished pre-flight checks# Start Backup Daemon...[ OK ]Open the Ops Manager URL in a browser: http://&lt;opsManagerHost&gt;:8080Click on Register then fill and submit the form, follow the guide for the basic configuration (that can be easily edited after)You should land in the Ops manager page!Automation agentOps Manager dapat mengotomatiskan semua MongoDB instances dan servers thanks to the Automation Agent that must be installed on all servers.CentOS (tutorial dari mongodb.com)Procedure ini telah divalidasikan di CentOS Linux release 7.4.1708 (Core)Log in ke serverpastikan ntp &amp; ntpupdate are installed12sudo yum install ntpupdatesudo ntpdate 0.centos.pool.ntp.orgports harus tidak sedang digunakan dan firewall mengizinkan traffic di ports antara server1234sudo firewall-cmd --permanent --zone=public --add-port=8080/tcpsudo firewall-cmd --permanent --zone=public --add-port=8443/tcpsudo firewall-cmd --permanent --zone=public --add-port=27000-28000/tcpsudo firewall-cmd --reloadpastikan semua URLS dikenal1sudo vi /etc/hostsuntuk contoh di Ops Manager URL1curl -ivs http://myopsmanagerurl:8080*download file package dari Ops Manager dan install *12curl -OL http://myopsmanagerurl:8080/download/agent/automation/mongodb-mms-automation-agent-manager-10.2.10.5921-1.x86_64.rhel7.rpmsudo rpm -U mongodb-mms-automation-agent-manager-10.2.10.5921-1.x86_64.rhel7.rpmikuti comment untuk mengisi mmsGroupId, mmsApiKey, mmsBaseUrl1sudo vi /etc/mongodb-mms/automation-agent.configbuat direktori data12sudo mkdir /datasudo chown mongod:mongod /datastart automation agent1sudo service mongodb-mms-automation-agent startcheck status1sudo service mongodb-mms-automation-agent statusinvestigate issues12ll /var/log/mongodb-mms-automationsudo more /var/log/mongodb-mms-automation/automation-agent-fatal.logAnda harusnya sekarang dapat melihat node di Ops Manager &gt; Deployment &gt; AgentsKnown issueslibsasl2.so.2: cannot open shared object file: No such file or directory/opt/mongodb-mms-automation/bin/mongodb-mms-automation-agent: error while loading shared libraries: libsasl2.so.2: cannot open shared object file: No such file or directoryFix:cd /lib64sudo ln -s libsasl2.so.3.0.0 libsasl2.so.2SocketException: Address already in useE STORAGE [initandlisten] Failed to set up listener: SocketException: Address already in useI CONTROL [initandlisten] now exitingI CONTROL [initandlisten] shutting down with code:48Fix:lihat proses yang menggunakan portsudo netstat -tulpn | grep :27000sudo kill processidUbuntu (tutorial from mongodb.com)Updates made from docs.cloudmanager.mongodb.com.Prosedur ini telah divalidasi di Ubuntu 16.04.1 LTSKonfigurasiMonitoringSetelah server di konfigurasi dan terlihat di Ops Manager, anda setidaknya harus instal satu agen monitoring di satu node.BackupPastikan backup agen terinstal di server (easy to install from the server view).Buat direktori untuk menyimpan head databases123mkdir /data/mongodb/backupdaemonsudo chown mongodb-mms:mongodb-mms /data/mongodb/backupdaemonsudo sudo chmod 774 -R /data/mongodb/backupdaemonDi Ops Manager, click Admin di kanan atas &gt; Backup tab. Ikuti langkah untuk konfigurasi backup storage. Anda dapat melalui storage di MongoDB dan koneksi dengan localhost:27018.Di Ops Manager, click Backup pada kiri dan buat entry baru.Email sendingJika terdapat error pada saat mengirim test message, anda dapat test langsung dari server Ops Manager.sudo yum install telnettelnet smtp.mycompany.lan 25AppendixFollow what’s going on!You can tail the automataion log file.1234567891011121314151617181920212223tail -f /var/log/mongodb-mms-automation/automation-agent.logYou can also look at the processes running on a MongoDB server.ps -ef | grep mongo# mongod 23947 1 0 14:15 ? 00:00:03 /var/lib/mongodb-mms-automation/mongodb-linux-x86_64-3.6.2/bin/mongod -f /data/rsDev2_12/automation-mongod.confsudo more /data/rsDev2_12/automation-mongod.conf# THIS FILE IS MAINTAINED BY http://myopsmanager:8080 . DO NOT MODIFY AS IT WILL BE OVERWRITTEN.# To make changes to your MongoDB deployment, please visit http://myopsmanager:8080 . Your Group ID is xxxxxxxxxxxxxxxxxxxxx .net: bindIp: 0.0.0.0 port: 27000processManagement: fork: &quot;true&quot;replication: replSetName: rsDev2storage: dbPath: /data/rsDev2_12systemLog: destination: file path: /data/rsDev2_12/mongodb.logsudo tail -f /data/rsDev2_12/mongodb.logCleanup a MongoDB serverIn case of issues, you may want to clean a server where a MongoDB automation agent was installed, or simply a MongoDB server.Remove MongoDB server123456789101112131415161718MongoDB files are located here: /var/lib/mongodb, /var/log/mongodb.sudo systemctl stop mongod.servicesudo systemctl disable mongod.servicesudo dpkg -P mongodsudo systemctl daemon-reloadsudo systemctl reset-failedsudo apt-get cleanRemove an automation agentMongoDB files are located here: /var/lib/mongodb-mms-automation, /var/log/mongodb-mms-automation.sudo systemctl stop mongodb-mms-automation-agentsudo dpkg -P mongodb-mms-automation-agent-managersudo rm -rf /etc/mongodb-mmssudo rm -rf /var/lib/mongodb-mms-automationsudo rm -rf /var/log/mongodb-mms-automationWait for 5 minutes so Ops manager consider the agent as down.WarningsIf you followed this procedure, you will probably get this warnings.Access control is not enabled for the databaseWARNING: Access control is not enabled for the database.Read and write access to data and configuration is unrestricted._This server is bound to localhostWARNING: This server is bound to localhost.Remote systems will be unable to connect to this server.Start the server with –bind_ipto specify which IPaddresses it should serve responses from, or with –bind_ip_all tobind to all interfaces. If this behavior is desired, start theserver with –bind_ip 127.0.0.1 to disable this warning./sys/kernel/mm/transparent_hugepage/enabled is ‘always’WARNING: /sys/kernel/mm/transparent_hugepage/enabled is ‘always’.We suggest setting it to ‘never’Using the XFS filesystem is strongly recommended with the WiredTiger storage engineWARNING: Using the XFS filesystem is strongly recommended with the WiredTiger storage engine,See http://dochub.mongodb.org/core/prodnotes-filesystem,You can review the different mount drives by executing: sudo df -hT.","link":"/install-ops-manager/"},{"title":"Install Zimbra Mail Server","text":"Cara Install Open Source Zimbra Mail Server (ZCS 8.8.12) di CentOS 7Server Mail adalah salah satu server yang penting dan kritikal untuk banyak organisasi karena kebanyakan komunikasi dilakukan melalui email. Di dunia Open source ada beberapa pasang server email gratis,tapi Zimbra adalah salah satu mail server teratas. Server Zimbra Mail atau disebut ZCS (Zimbra Collaboration Suite) ada dalam dua versi, versi Open Source dan enterprise.PrerequisitesMinimal CentOS 78 GB RAM5 GB Free Space on /optFQDN (Fully Qualified Domain Name), in my case it is “mail.example.com”A &amp; MX record for your ServerStep:1) Login ke CentOS 7 dan apply updates.Login ke Server CentOS 7 dan update terbaru menggunakan perintah yum dan kemudian reboot ,1yum update &amp;&amp; yum upgrade -y ; rebootSetelah reboot, set hostname dari server, dalam kasus saya menggunakan “mail.example.com”12~]# hostnamectl set-hostname &quot;mail.example.com&quot;~]# exec bashTambah perintah berikut di /etc/hosts file,1192.168.0.108 mail.example.com mailSetelah konfigurasi hostname, verifikasi A dan MX terkonfigurasi untuk domain menggunakan perintah dig,12[root@mail ~]# dig -t A mail.example.com[root@mail ~]# dig -t MX example.comDisable SelinuxBerikut, disable SELinux. check status dari SELinux, jalankan perintah seperti berikut.1getenforceOutput1enforcingUntuk mengganti dari enforcing ke disabled ikuti langkah seperti berikutvim /etc/selinux/configGanti SELinux dari enforcing ke disabled seperti berikutDisable Unwanted ServicesInstalasi default CentOS 7 dengan postfix daemon telah terinstal dan berjalan. Untuk disable dan hapus service postfix jalankan perintah berikut:12systemctl stop postfixsystemctl disable postfixInstall extra packagesBerikut, install beberapa paket yang di perlukan12yum -y install unzip net-tools sysstat openssh-clients perl-core libaio nmap-ncat libstdc++.so.6 wget libreoffice-headless libreoffice bind-utilsReboot serverAt this point, reboot the system.1rebootStep:2) Install Zimbra dependencies menggunakan yumJalankan perintah berikut untuk install Zimbra / ZCS dependencies1[root@mail ~]# yum install unzip net-tools sysstat openssh-clients perl-core libaio nmap-ncat libstdc++.so.6 wget -yStep:3) Download versi terbaru dari Zimbra (ZCS 8.8.12) menggunakan wget commandBuat folder dengan nama “zimbra”1[root@mail ~]# mkdir zimbra &amp;&amp; cd zimbraGunakan perintah wget seperti berikut untuk download versi terbaru dari ZCS 8.8.10 dari terminal,1[root@mail zimbra]# wget https://files.zimbra.com/downloads/8.8.12_GA/zcs-8.8.12_GA_3794.RHEL6_64.20190329045002.tgz --no-check-certificateStep:4) Install Zimbra / ZCS 8.8.12Extract download tgz file of ZCS 8.8.10 menggunakan perintah tar seperti berikut1[root@mail zimbra]# tar zxpvf zcs-8.8.10_GA_3039.RHEL7_64.20180928094617.tgzbuka folder hasil extract dan jalankan script install,12[root@mail zimbra]# cd zcs-8.8.12_GA_3794.RHEL6_64.20190329045002[root@mail zcs-8.8.12_GA_3794.RHEL6_64.20190329045002]# ./install.shkamu akan melihat sebuah text based wizard.123456789101112131415161718192021Operations logged to /tmp/install.log.luSct9PmChecking for existing installation... zimbra-chat...NOT FOUND zimbra-drive...NOT FOUND zimbra-imapd...NOT FOUND zimbra-network-modules-ng...NOT FOUND zimbra-rpost...NOT FOUND zimbra-ldap...NOT FOUND zimbra-logger...NOT FOUND zimbra-mta...NOT FOUND zimbra-dnscache...NOT FOUND zimbra-snmp...NOT FOUND zimbra-store...NOT FOUND zimbra-apache...NOT FOUND zimbra-spell...NOT FOUND zimbra-convertd...NOT FOUND zimbra-memcached...NOT FOUND zimbra-proxy...NOT FOUND zimbra-archiving...NOT FOUND zimbra-core...NOT FOUNDIMPORTANT-READ CAREFULLY: THE TERMS OF THIS END USER LICENSE AGREEMENT (&quot;EULA&quot;) WILL GOVERN YOUR USE OF THE SOFTWARE. BY DOWNLOADING, INSTALLING, OR USING THE SOFTWARE, YOU (THE INDIVIDUAL OR LEGAL ENTITY) ARE (1)¬†REPRESENTING THAT YOU ARE OVER THE AGE OF 18 AND HAVE THE CAPACITY AND AUTHORITY TO BIND YOURSELF OR THE LEGAL ENTITY, AS APPLICABLE, TO THE TERMS OF THIS EULA AND (2)¬†AGREEING ON BEHALF OF YOURSELF AND/OR AS AN AUTHORIZED REPRESENTATIVE OF THE LEGAL ENTITY, AS APPLICABLE, TO BE BOUND BY THIS EULA. IF YOU DO NOT AGREE TO THE TERMS OF THIS EULA, YOU MUST NOT DOWNLOAD, INSTALL, OR USE THE SOFTWARE.Select “y” on the two EULA and license agreement questions.123456789101112131415161718192021222324252627The parties acknowledge and agree that a material breach of thisAgreement adversely affecting Autonomy's proprietary rights would causeirreparable harm to Autonomy for which a remedy at law would be inadequate andthat Autonomy shall be entitled to injunctive relief in addition to anyremedies it may have hereunder or at law.Do you agree with the terms of the software license agreement? [N]y Use Zimbra's package repository [Y] y Importing Zimbra GPG key Configuring package repository Checking for installable packages Found zimbra-core (local) Found zimbra-ldap (local) Found zimbra-logger (local) Found zimbra-mta (local) Found zimbra-dnscache (local) Found zimbra-snmp (local) Found zimbra-store (local) Found zimbra-apache (local) Found zimbra-spell (local) Found zimbra-convertd (local) Found zimbra-memcached (repo) Found zimbra-proxy (local) Found zimbra-archiving (local) Found zimbra-chat (repo) Found zimbra-drive (repo) Found zimbra-imapd (local) Found zimbra-network-modules-ng (local)In this blog, we are going to install all packages except the convertd, chat , drive , imapd and network-modules-ngand, which are still in beta:1234567891011121314151617Select the packages to installInstall zimbra-ldap [Y] Install zimbra-logger [Y] Install zimbra-mta [Y] Install zimbra-dnscache [Y] Install zimbra-snmp [Y] Install zimbra-store [Y] Install zimbra-apache [Y] Install zimbra-spell [Y] Install zimbra-convertd [Y] nInstall zimbra-memcached [Y] Install zimbra-proxy [Y] Install zimbra-archiving [N] Install zimbra-chat [Y] nInstall zimbra-drive [Y] nInstall zimbra-imapd (BETA - for evaluation only) [N] nInstall zimbra-network-modules-ng [Y] nPress “y” to allow modification of the system:123456789101112The system will be modified. Continue? [N] YBeginning Installation - see /tmp/install.log.luSct9Pm for details...zimbra-core-components will be downloaded and installed.zimbra-timezone-data will be installed.zimbra-common-mbox-conf-msgs will be installed.zimbra-common-mbox-db will be installed.zimbra-common-mbox-conf will be installed.zimbra-common-mbox-native-lib will be installed.zimbra-common-mbox-docs will be installed.zimbra-common-mbox-conf-attrs will be installed.zimbra-common-mbox-conf-rights will be installed.zimbra-core will be installed.......This is another hot step. You need to select yes to change the domain and select your own instead mail.example.com, just example.comDNS ERROR resolving MX for mail.example.com It is suggested that the domain name have an MX record configured in DNS Change domain name? [Yes] Y Create domain: [mail.example.com] example.com .... done. Checking for port conflictsYou need to change the admin password by pressing the number 6 (zimbra-store) and then number 4 on the submenu:1234567891011121314151617181920212223Main menu 1) Common Configuration: 2) zimbra-ldap: Enabled 3) zimbra-logger: Enabled 4) zimbra-mta: Enabled 5) zimbra-snmp: Enabled 6) zimbra-store: Enabled 7) zimbra-spell: Enabled 8) zimbra-convertd: Enabled 9) zimbra-proxy: Enabled 10) Default Class of Service Configuration: 11) Enable default backup schedule: yes s) Save config to file x) Expand menu q) Quit *** CONFIGURATION COMPLETE - press 'a' to applyPress “a” to apply the changes:Select from menu, or press 'a' to apply config (? - help) a.......Save configuration data to a file? [Yes]......Save config in file: [/opt/zimbra/config.10904]Saving config in /opt/zimbra/config.10904...done.Press “y” to continue:1234567891011121314151617181920212223242526272829Operations logged to /tmp/zmsetup.20180111-132052.logSetting local config values...done.Initializing core config...Setting up CA...done.Deploying CA to /opt/zimbra/conf/ca ...done.Creating SSL zimbra-store certificate...done.Creating new zimbra-ldap SSL certificate...done.Creating new zimbra-mta SSL certificate...done.Creating new zimbra-proxy SSL certificate...done.Installing mailboxd SSL certificates...done.Installing MTA SSL certificates...done.Installing LDAP SSL certificate...done.Installing Proxy SSL certificate...done.Initializing ldap...done.Setting replication password...done.Setting Postfix password...done.Setting amavis password...done.Setting nginx password...done.Setting BES searcher password...done.Creating server entry for zcs-886.zimbra.io...done.Setting Zimbra IP Mode...done.Saving CA in ldap...done.Saving SSL Certificate in ldap...done.Setting spell check URL...done.Setting service ports on zcs-886.zimbra.io...done.Setting zimbraFeatureTasksEnabled=TRUE...done.Setting zimbraFeatureBriefcasesEnabled=TRUE...done.Checking current setting of zimbraReverseProxyAvailableLookupTargetsQuerying LDAP for other mailstoresSearching LDAP for reverseProxyLookupTargets...done.Press “enter” to finish the installation:12Moving /tmp/zmsetup.20180111-132052.log to /opt/zimbra/log Configuration complete - press return to exitSetelah instalasi berhasil, buka browser dan buka alamat server’s IPZimbra-Installation-Completed-CentOS7Step: 5) Konfigurasi FirewallBuka ports di firewall jika os firewall running di server12345[root@mail ~]# firewall-cmd --permanent --add-port={25,80,110,143,443,465,587,993,995,5222,5223,9071,7071}/tcpsuccess[root@mail ~]# firewall-cmd --reloadsuccess[root@mail ~]#Step:6) Akses Zimbra Admin Portal & Web Mail ClientUntuk mengakses Zimbra Admin Portal, ketik URL di bawah dalam Web Browserhttps://mail.example.com:7071/","link":"/install-zimbra/"},{"title":"Install MongoDB Cluster","text":"Cara Install MongoDB Sharded Cluster di CentOS 7Sharding adalah proses MongoDB untuk mengirim data-set melalui mesin yang berbeda. Dan mengizinkan untuk melakukan horizontal scale dari data, partisi data melalui independent instances, dan dapat menjadi ‘Replica Sets’. Partisi Data-set di ‘Sharding’ menggunakan shard key. Sharding mengizinkan untuk menambah mesin lebih berdasarkan pertumbuhan data.Sharding dan ReplicationSecara sederhana. Ketika kamu punya koleksi musik, ‘Sharding’ akan menyimpan dan menjaga koleksi musikmu ke folder yang berbeda. ‘Replication,’ di sisi lain, hanya syncing koleksi musik kamu ke instances yang lain.Tiga Sharding KomponenShard - Digunakan untuk menyimpan seluruh data, dan di linkungan production, masing-masing shard adalah replica sets. Menyediakan ketersediaan tinggi dan konsistensi data.Config Server - Digunakan untuk menyimpan cluster metadata, berisi pemetaan dari cluster data set dan shards. Data ini digunakan oleh server mongos/query untuk mengirim operations. Disarankan untuk menggunakan lebih dari 3 instances in production.Mongos/Query Router - Ini hanya mongo instances berjalan sebagai application interfaces. Aplikasi akan membuat requests ke mongos instances, dan kemudian mongos akan mengirim requests menggunakan shard key untuk memecah ke replica sets.Prerequisites3 centOS 7 server as Config, Shard, and Mongos/Query Router123192.168.88.100 mongod1192.168.88.101 mongod2192.168.88.102 mongod3PORT123427017 mongos/Query27018 Config Replica Set27019 Shard1 Replica Set27020 Shard2 Replica SetRoot privilegesEach server connected to another serverStep 1 - Disable SELinux dan Configure HostsUntuk tutorial ini, kita akan disable SELinux. Ganti konfigurasi SELinux dari 'enforcing' ke 'disabled'.Connect ke semua nodes melalui OpenSSH.1ssh root@SERVERIPDisable SELinux dengan perintah sebagai berikut.1vim /etc/sysconfig/selinuxGanti SELinux menjadi ‘disabled’.1SELINUX=disabledSave dan exit.Berikutnya, edit hosts file di masing-masing server.1vim /etc/hostsikuti konfigurasi hosts sebagai berikut:123192.168.88.100 mongod1192.168.88.101 mongod2192.168.88.102 mongod3Save dan exit.Sekarang restart semua serverStep 2 - Install MongoDB di semua ServerKita akan menggunakan latest MongoDB (MongoDB 4.2) untuk semua instances. Tambah repositori baru MongoDB dengan perintah sebagai berikut:12345678cat &lt;&lt;'EOF' &gt;&gt; /etc/yum.repos.d/mongodb.repo[mongodb-org-4.2]name=MongoDB Repositorybaseurl=https://repo.mongodb.org/yum/redhat/$releasever/mongodb-org/4.2/x86_64/gpgcheck=1enabled=1gpgkey=https://www.mongodb.org/static/pgp/server-4.2.ascEOFSekarang install mongodb 4.2 dari repositori mongodb menggunakan perintah yum seperti perintah dibawah.1sudo yum -y install mongodb-orgSetelah mongodb is terinstall, gunakan perintah ‘mongo’ atau ‘mongod’seperti berikut untuk melihat versi.1mongod --versionInstall MongoDB di semua InstancesStep 3 - Create Config, Shard Server Replica Sets and Mongos/Query di setiap ServerPada bagian syarat, kita telah menetapkan server config dengan 3 mesin dengan 'configsvr'. Dan di langkah ini, kita akan konfigurasikan ke replica set.Jika ada service mongod yang jalan di server, stop dengan perintah systemctl sebagai berikut.12systemctl stop mongodsystemctl disable mongodcopy mongod.conf1234cp /etc/mongod.conf /home/mongoconfig.confcp /etc/mongod.conf /home/shard1.confcp /etc/mongod.conf /home/shard2.confcp /etc/mongod.conf /home/mongos.confbuka mongodb configuration ‘mongoconfig.conf’.1vim /home/mongoconfig.confChange DB storage path to your own directory. We will use ‘/mongodb/mongoconfig/‘.12345678910111213systemLog: destination: file logAppend: true path: /mongodb/mongoconfig/log/configsvr.logstorage: dbPath: /mongodb/mongoconfig/datanet: port: 27018bindIP: 192.168.88.100,127.0.0.1replication: replSetName: &quot;rs0&quot;sharding: clusterRole: configsvrSave dan exit.open mongodb configuration ‘shard1.conf’.1vim /home/shard1.confRubah penempatan DB. Kami menggunakan /mongodb/shard1/.12345678910111213systemLog: destination: file logAppend: true path: /mongodb/shard/log/shard1.logstorage: dbPath: /mongodb/shard/shard1/datanet: port: 27019bindIP: 192.168.88.100,127.0.0.1replication: replSetName: &quot;rs1&quot;sharding: clusterRole: shardsvrSave dan exit.buka mongodb configuration ‘shard2.conf’.1vim /home/shard2.confRubah penempatan DB. Kami menggunakan /mongodb/shard2/.12345678910111213systemLog: destination: file logAppend: true path: /mongodb/shard/log/shard2.logstorage: dbPath: /mongodb/shard/shard2/datanet: port: 27020bindIP: 192.168.88.100,127.0.0.1replication: replSetName: &quot;rs2&quot;sharding: clusterRole: shardsvrSave and exit.Buka mongodb configuration ‘mongos.conf’.1vim /home/mongos.confRubah penempatan log file. Nonaktifkan (beri tanda command) di storage dan replication123456789systemLog: destination: file logAppend: true path: /mongodb/mongos/log/mongos.lognet: port: 27017bindIP: 192.168.88.100,127.0.0.1sharding: configDB: rs0/192.168.88.100:27018,192.168.88.101:27018,192.168.88.102:27018Save and exit.Create FolderBerikut, kita harus membuat direktori baru untuk data MongoDB, dan kemudian ganti permisi kepemilikan dari direktori ke user ‘mongod’.123456789101112mkdir -p /mongodb/mongoconfig/logmkdir -p /mongodb/mongoconfig/datamkdir -p /mongodb/shard/logmkdir -p /mongodb/shard/shard1/datamkdir -p /mongodb/shard/shard2/datamkdir -p /mongodb/mongos/log/mongos.logchown -R mongod:mongod /mongodb/mongoconfig/logchown -R mongod:mongod /mongodb/mongoconfig/datachown -R mongod:mongod /mongodb/shard/logchown -R mongod:mongod /mongodb/shard/shard1/datachown -R mongod:mongod /mongodb/shard/shard2/datachown -R mongod:mongod /mongodb/mongos/log/mongos.logBerikut, mulai service mongod dengan perintah berikut.1234mongod --config /home/mongoconfig.confmongod --config /home/shard1.confmongod --config /home/shard2.confmongos --config /home/mongos.confAnda bisa melihat service mongod sedang berjalan dengan perintah netstat.1netstat -plntuUlangi langkah ini di semua serverStep 4 - Initiate member on all mongodMenambah Config Server in Replica SetConfigsvr siap untuk replica set. Connect ke server ‘mongod1’ dan akses ke mongo shell.12ssh root@mongod1mongo --port 27018Initiate nama replica set dengan semua anggota configsvr menggunakan query berikut.123rs.initiate()rs.add(&quot;192.168.88.101:27018&quot;)rs.add(&quot;192.168.88.102:27018&quot;)Jika mendapatkan hasil’{ “ok” : 1 }’, itu berarti configsvr telah terkonfigurasi dengan replica set.Initiate nama replica set dengan semua anggota configsvrdan kamu akan dapat melihat yang mana node master dan yang mana node secondary.1rs.status()Konfigurasi dari Server Config Replika set telah selesai.konfigurasi dari Server Config Replica SetAdd Shard Server in Replica SetShard1 and Shard2 telah siap untuk replica set. Connect menuju server ‘mongod1’ dan akses ke mongo shell.--port 27019```12Initiate nama replica set dengan semua anggota Shard1 menggunakan query berikut.rs.initiate()rs.add(“192.168.88.101:27019”)rs.add(“192.168.88.102:27019”)rs.status()exit1```mongo --port 27020Initiate nama replica set dengan semua anggota Shard2 menggunakan query berikut.12345rs.initiate()rs.add(&quot;192.168.88.101:27020&quot;)rs.add(&quot;192.168.88.102:27020&quot;)rs.status()exitJika mendapatkan hasil’{ “ok” : 1 }’, itu berarti Shard telah terkonfigurasi dengan replica set.Initiate nama replica set dengan semua anggota Shards dan kamu akan dapat melihat yang mana node master dan yang mana node secondary.Konfigurasi dari server Config telah selesai.Konfigurasi dari Server Shard Replica SetTambah Anggota MongosKonfigurasi mongos/Query Router12345mongo --port 27017sh.addShard( &quot;rs1/192.168.88.100:27019,192.168.88.101:27019,192.168.88.102:27019&quot;)sh.addShard( &quot;rs1/192.168.88.100:27020,192.168.88.101:27020,192.168.88.102:27020&quot;)sh.status()MongoDB sharded cluster di CentOS 7 sukses terinstal.reffHowtoforgeMongoDB","link":"/install-mongodb-cluster/"}],"tags":[{"name":"Zimbra","slug":"Zimbra","link":"/tags/Zimbra/"},{"name":"MongoDB","slug":"MongoDB","link":"/tags/MongoDB/"}],"categories":[{"name":"HowTo","slug":"HowTo","link":"/categories/HowTo/"},{"name":"Install","slug":"Install","link":"/categories/Install/"}]}